In [2]:
import pandas as pd
link="https://raw.githubusercontent.com/Anasuya-Sahoo/DMDW-Lab/main/Toyota.csv"
df=pd.read_csv(link)
df

      Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0              0  13500  23.0  46986  ...         0  2000  three    1165
1              1  13750  23.0  72937  ...         0  2000      3    1165
2              2  13950  24.0  41711  ...         0  2000      3    1165
3              3  14950  26.0  48000  ...         0  2000      3    1165
4              4  13750  30.0  38500  ...         0  2000      3    1170
...          ...    ...   ...    ...  ...       ...   ...    ...     ...
1431        1431   7500   NaN  20544  ...         0  1300      3    1025
1432        1432  10845  72.0     ??  ...         0  1300      3    1015
1433        1433   8500   NaN  17016  ...         0  1300      3    1015
1434        1434   7250  70.0     ??  ...         0  1300      3    1015
1435        1435   6950  76.0      1  ...         0  1600      5    1114

[1436 rows x 11 columns]

In [3]:
#It returns class type of the argument or object.
type(df)

pandas.core.frame.DataFrame

In [4]:
#It returns the shape of the dataframe
df.shape

(1436, 11)

In [5]:
#It returns a concise summeryof the dataframe.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 123.5+ KB

In [6]:
#it returns top n rows from the dataframe. By deafault n=5
df.head()

   Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0           0  13500  23.0  46986  ...         0  2000  three    1165
1           1  13750  23.0  72937  ...         0  2000      3    1165
2           2  13950  24.0  41711  ...         0  2000      3    1165
3           3  14950  26.0  48000  ...         0  2000      3    1165
4           4  13750  30.0  38500  ...         0  2000      3    1170

[5 rows x 11 columns]

In [7]:
df.head(10)

   Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0           0  13500  23.0  46986  ...         0  2000  three    1165
1           1  13750  23.0  72937  ...         0  2000      3    1165
2           2  13950  24.0  41711  ...         0  2000      3    1165
3           3  14950  26.0  48000  ...         0  2000      3    1165
4           4  13750  30.0  38500  ...         0  2000      3    1170
5           5  12950  32.0  61000  ...         0  2000      3    1170
6           6  16900  27.0     ??  ...         0  2000      3    1245
7           7  18600  30.0  75889  ...         0  2000      3    1245
8           8  21500  27.0  19700  ...         0  1800      3    1185
9           9  12950  23.0  71138  ...         0  1900      3    1105

[10 rows x 11 columns]

In [8]:
#it returns bottom n rows from the dataframe. By deafault n=5
df.tail()

      Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
1431        1431   7500   NaN  20544  ...         0  1300      3    1025
1432        1432  10845  72.0     ??  ...         0  1300      3    1015
1433        1433   8500   NaN  17016  ...         0  1300      3    1015
1434        1434   7250  70.0     ??  ...         0  1300      3    1015
1435        1435   6950  76.0      1  ...         0  1600      5    1114

[5 rows x 11 columns]

In [11]:
#acccess top 10 tuples from 'price' and 'age' attribute
df.loc[:10,['Price','Age']]

    Price   Age
0   13500  23.0
1   13750  23.0
2   13950  24.0
3   14950  26.0
4   13750  30.0
5   12950  32.0
6   16900  27.0
7   18600  30.0
8   21500  27.0
9   12950  23.0
10  20950  25.0

In [13]:
#acccess top 10 tuples from 'price' and 'age' attribute
df[['Price','Age']].head(10)

   Price   Age
0  13500  23.0
1  13750  23.0
2  13950  24.0
3  14950  26.0
4  13750  30.0
5  12950  32.0
6  16900  27.0
7  18600  30.0
8  21500  27.0
9  12950  23.0

#Working with NULL values

In [14]:
#It returns the number of missing values in the dataset.
df.isnull().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [15]:
#It helps to check missing values.
df.isnull()

      Unnamed: 0  Price    Age     KM  ...  Automatic     CC  Doors  Weight
0          False  False  False  False  ...      False  False  False   False
1          False  False  False  False  ...      False  False  False   False
2          False  False  False  False  ...      False  False  False   False
3          False  False  False  False  ...      False  False  False   False
4          False  False  False  False  ...      False  False  False   False
...          ...    ...    ...    ...  ...        ...    ...    ...     ...
1431       False  False   True  False  ...      False  False  False   False
1432       False  False  False  False  ...      False  False  False   False
1433       False  False   True  False  ...      False  False  False   False
1434       False  False  False  False  ...      False  False  False   False
1435       False  False  False  False  ...      False  False  False   False

[1436 rows x 11 columns]

In [16]:
#It returns if there are any missing values present in dataframe or not.
df.isnull().values.any()

True

In [17]:
#It returns number of non-missing values in each column.
df.notnull().sum()

Unnamed: 0    1436
Price         1436
Age           1336
KM            1436
FuelType      1336
HP            1436
MetColor      1286
Automatic     1436
CC            1436
Doors         1436
Weight        1436
dtype: int64

**1st Method: Removing the tuples which contains the null values.**

In [18]:
#This method is used to remove missing value records from the dataframe.
df.dropna(inplace=True)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1111 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1111 non-null   int64
 1   Price       1111 non-null   int64
 2   Age         1111 non-null   float64
 3   KM          1111 non-null   object
 4   FuelType    1111 non-null   object
 5   HP          1111 non-null   object
 6   MetColor    1111 non-null   float64
 7   Automatic   1111 non-null   int64
 8   CC          1111 non-null   int64
 9   Doors       1111 non-null   object
 10  Weight      1111 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 104.2+ KB

In [20]:
df.isnull().sum()

Unnamed: 0    0
Price         0
Age           0
KM            0
FuelType      0
HP            0
MetColor      0
Automatic     0
CC            0
Doors         0
Weight        0
dtype: int64

In [21]:
link="https://raw.githubusercontent.com/Anasuya-Sahoo/DMDW-Lab/main/Toyota.csv"
data=pd.read_csv(link)
data

      Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0              0  13500  23.0  46986  ...         0  2000  three    1165
1              1  13750  23.0  72937  ...         0  2000      3    1165
2              2  13950  24.0  41711  ...         0  2000      3    1165
3              3  14950  26.0  48000  ...         0  2000      3    1165
4              4  13750  30.0  38500  ...         0  2000      3    1170
...          ...    ...   ...    ...  ...       ...   ...    ...     ...
1431        1431   7500   NaN  20544  ...         0  1300      3    1025
1432        1432  10845  72.0     ??  ...         0  1300      3    1015
1433        1433   8500   NaN  17016  ...         0  1300      3    1015
1434        1434   7250  70.0     ??  ...         0  1300      3    1015
1435        1435   6950  76.0      1  ...         0  1600      5    1114

[1436 rows x 11 columns]

#2nd Method: Replace the NULL values with mean values.

In [22]:
data.isnull().sum()

Unnamed: 0      0
Price           0
Age           100
KM              0
FuelType      100
HP              0
MetColor      150
Automatic       0
CC              0
Doors           0
Weight          0
dtype: int64

In [25]:
#It returns the mean value for MetColor attribute.
data['MetColor'].mean()

0.6749611197511665

In [26]:
data['MetColor'].head(10)

0    1.0
1    1.0
2    NaN
3    0.0
4    0.0
5    0.0
6    NaN
7    1.0
8    0.0
9    NaN
Name: MetColor, dtype: float64

In [27]:
import numpy as np

In [29]:
#Replaces the NaN values with mean value.
data['MetColor'].replace(np.NaN,data['MetColor'].mean()).head(10)

0    1.000000
1    1.000000
2    0.674961
3    0.000000
4    0.000000
5    0.000000
6    0.674961
7    1.000000
8    0.000000
9    0.674961
Name: MetColor, dtype: float64